ElectronicCats/ArduinoCore-mbed/boards.txt
##############################################################
# HUNTER CAT NFC RP2040
#############################################################

huntercatnfc_2040.name=Electronic Cats HunterCat NFC2040
huntercatnfc_2040.build.core=arduino
huntercatnfc_2040.build.crossprefix=arm-none-eabi-
huntercatnfc_2040.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/
huntercatnfc_2040.build.variant=HUNTERCATNFC_RP2040
huntercatnfc_2040.build.mcu=cortex-m0plus
huntercatnfc_2040.build.extra_flags=
huntercatnfc_2040.build.fpu=
huntercatnfc_2040.build.float-abi=
huntercatnfc_2040.build.architecture=cortex-m0plus
huntercatnfc_2040.build.board=HUNTERCATNFC_RP2040
huntercatnfc_2040.build.ldscript=linker_script.ld
huntercatnfc_2040.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
huntercatnfc_2040.compiler.mbed.arch.define=-DARDUINO_ARCH_RP2040 -DARDUINO_NANO_RP2040_CONNECT
huntercatnfc_2040.compiler.mbed.defines={build.variant.path}/defines.txt
huntercatnfc_2040.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
huntercatnfc_2040.compiler.mbed.cflags={build.variant.path}/cflags.txt
huntercatnfc_2040.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
huntercatnfc_2040.compiler.mbed.includes={build.variant.path}/includes.txt
huntercatnfc_2040.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
huntercatnfc_2040.compiler.mbed="{build.variant.path}/libs/libmbed.a"
huntercatnfc_2040.vid.0=0x1209
huntercatnfc_2040.pid.0=0x005e
huntercatnfc_2040.vid.1=0x1209
huntercatnfc_2040.pid.1=0x805e
huntercatnfc_2040.vid.2=0x1209
huntercatnfc_2040.pid.2=0x015e
huntercatnfc_2040.vid.3=0x1209
huntercatnfc_2040.pid.3=0x025e
huntercatnfc_2040.upload_port.0.vid=0x1209
huntercatnfc_2040.upload_port.0.pid=0x005e
huntercatnfc_2040.upload_port.1.vid=0x1209
huntercatnfc_2040.upload_port.1.pid=0x805e
huntercatnfc_2040.upload_port.2.vid=0x1209
huntercatnfc_2040.upload_port.2.pid=0x015e
huntercatnfc_2040.upload_port.3.vid=0x1209
huntercatnfc_2040.upload_port.3.pid=0x025e
huntercatnfc_2040.upload.tool=picotool
huntercatnfc_2040.upload.tool.default=picotool
huntercatnfc_2040.upload.protocol=
huntercatnfc_2040.upload.transport=
huntercatnfc_2040.upload.use_1200bps_touch=true
huntercatnfc_2040.upload.wait_for_upload_port=false
huntercatnfc_2040.upload.native_usb=true
huntercatnfc_2040.upload.maximum_size=2097152
huntercatnfc_2040.upload.maximum_data_size=262144
huntercatnfc_2040.bootloader.tool=openocd
huntercatnfc_2040.bootloader.tool.default=openocd
huntercatnfc_2040.bootloader.config=-f target/rp2040.cfg
huntercatnfc_2040.bootloader.programmer=-f interface/cmsis-dap.cfg

##############################################################
# CATWAN USB STICK RP2040
#############################################################

catwan_usb_stick_2040.name=Electronic Cats CatWAN USB Stick 2040
catwan_usb_stick_2040.build.core=arduino
catwan_usb_stick_2040.build.crossprefix=arm-none-eabi-
catwan_usb_stick_2040.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/
catwan_usb_stick_2040.build.variant=CATWAN_USB_2040
catwan_usb_stick_2040.build.mcu=cortex-m0plus
catwan_usb_stick_2040.build.extra_flags=
catwan_usb_stick_2040.build.fpu=
catwan_usb_stick_2040.build.float-abi=
catwan_usb_stick_2040.build.architecture=cortex-m0plus
catwan_usb_stick_2040.build.board=CATWAN_USB_2040
catwan_usb_stick_2040.build.ldscript=linker_script.ld
catwan_usb_stick_2040.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
catwan_usb_stick_2040.compiler.mbed.arch.define=-DARDUINO_ARCH_RP2040
catwan_usb_stick_2040.compiler.mbed.defines={build.variant.path}/defines.txt
catwan_usb_stick_2040.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
catwan_usb_stick_2040.compiler.mbed.cflags={build.variant.path}/cflags.txt
catwan_usb_stick_2040.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
catwan_usb_stick_2040.compiler.mbed.includes={build.variant.path}/includes.txt
catwan_usb_stick_2040.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
catwan_usb_stick_2040.compiler.mbed="{build.variant.path}/libs/libmbed.a"
catwan_usb_stick_2040.vid.0=0x1209
catwan_usb_stick_2040.pid.0=0x005e
catwan_usb_stick_2040.vid.1=0x1209
catwan_usb_stick_2040.pid.1=0x805e
catwan_usb_stick_2040.vid.2=0x1209
catwan_usb_stick_2040.pid.2=0x015e
catwan_usb_stick_2040.vid.3=0x1209
catwan_usb_stick_2040.pid.3=0x025e
catwan_usb_stick_2040.upload_port.0.vid=0x1209
catwan_usb_stick_2040.upload_port.0.pid=0x005e
catwan_usb_stick_2040.upload_port.1.vid=0x1209
catwan_usb_stick_2040.upload_port.1.pid=0x805e
catwan_usb_stick_2040.upload_port.2.vid=0x1209
catwan_usb_stick_2040.upload_port.2.pid=0x015e
catwan_usb_stick_2040.upload_port.3.vid=0x1209
catwan_usb_stick_2040.upload_port.3.pid=0x025e
catwan_usb_stick_2040.upload.tool=picotool
catwan_usb_stick_2040.upload.tool.default=picotool
catwan_usb_stick_2040.upload.protocol=
catwan_usb_stick_2040.upload.transport=
catwan_usb_stick_2040.upload.use_1200bps_touch=true
catwan_usb_stick_2040.upload.wait_for_upload_port=false
catwan_usb_stick_2040.upload.native_usb=true
catwan_usb_stick_2040.upload.maximum_size=2097152
catwan_usb_stick_2040.upload.maximum_data_size=262144
catwan_usb_stick_2040.bootloader.tool=openocd
catwan_usb_stick_2040.bootloader.tool.default=openocd
catwan_usb_stick_2040.bootloader.config=-f target/rp2040.cfg
catwan_usb_stick_2040.bootloader.programmer=-f interface/cmsis-dap.cfg

##############################################################
# CATSNIFFER V3
#############################################################

catsniffer_v3.name=Electronic Cats CatSniffer v3
catsniffer_v3.build.core=arduino
catsniffer_v3.build.crossprefix=arm-none-eabi-
catsniffer_v3.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/
catsniffer_v3.build.variant=CATSNIFFER_V3
catsniffer_v3.build.mcu=cortex-m0plus
catsniffer_v3.build.extra_flags=
catsniffer_v3.build.fpu=
catsniffer_v3.build.float-abi=
catsniffer_v3.build.architecture=cortex-m0plus
catsniffer_v3.build.board=CATSNIFFER_V3
catsniffer_v3.build.ldscript=linker_script.ld
catsniffer_v3.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
catsniffer_v3.compiler.mbed.arch.define=-DARDUINO_ARCH_RP2040
catsniffer_v3.compiler.mbed.defines={build.variant.path}/defines.txt
catsniffer_v3.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
catsniffer_v3.compiler.mbed.cflags={build.variant.path}/cflags.txt
catsniffer_v3.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
catsniffer_v3.compiler.mbed.includes={build.variant.path}/includes.txt
catsniffer_v3.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
catsniffer_v3.compiler.mbed="{build.variant.path}/libs/libmbed.a"
catsniffer_v3.vid.0=0x1209
catsniffer_v3.pid.0=0x005e
catsniffer_v3.vid.1=0x1209
catsniffer_v3.pid.1=0x805e
catsniffer_v3.vid.2=0x1209
catsniffer_v3.pid.2=0x015e
catsniffer_v3.vid.3=0x1209
catsniffer_v3.pid.3=0x025e
catsniffer_v3.upload_port.0.vid=0x1209
catsniffer_v3.upload_port.0.pid=0x005e
catsniffer_v3.upload_port.1.vid=0x1209
catsniffer_v3.upload_port.1.pid=0x805e
catsniffer_v3.upload_port.2.vid=0x1209
catsniffer_v3.upload_port.2.pid=0x015e
catsniffer_v3.upload_port.3.vid=0x1209
catsniffer_v3.upload_port.3.pid=0x025e
catsniffer_v3.upload.tool=picotool
catsniffer_v3.upload.tool.default=picotool
catsniffer_v3.upload.protocol=
catsniffer_v3.upload.transport=
catsniffer_v3.upload.use_1200bps_touch=true
catsniffer_v3.upload.wait_for_upload_port=false
catsniffer_v3.upload.native_usb=true
catsniffer_v3.upload.maximum_size=2097152
catsniffer_v3.upload.maximum_data_size=262144
catsniffer_v3.bootloader.tool=openocd
catsniffer_v3.bootloader.tool.default=openocd
catsniffer_v3.bootloader.config=-f target/rp2040.cfg
catsniffer_v3.bootloader.programmer=-f interface/cmsis-dap.cfg